[Killed] BlockStatement
Projects/mutation-testing-demo/src/is-old-enough.js:1:31
-const isOldEnough = (user) => {
-  return user.age >= 18
-}
+const isOldEnough = (user) => {}
 
 module.exports = isOldEnough
killedBy: isOver18 works with eq
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
Projects/mutation-testing-demo/src/is-old-enough.js:2:10
 const isOldEnough = (user) => {
-  return user.age >= 18
+  return user.age > 18
 }
 
killedBy: isOver18 works with eq
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
Projects/mutation-testing-demo/src/is-old-enough.js:2:10
 const isOldEnough = (user) => {
-  return user.age >= 18
+  return false
 }
 
killedBy: isOver18 works with eq
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
