[Killed] BlockStatement
Projects/stryker/src/is-over-18.js:1:28
-const isOver18 = (user) => {
-  return user.age >= 18
-}
+const isOver18 = (user) => {}
 
 module.exports = isOver18
killedBy: isOver18 works with eq
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
Projects/stryker/src/is-over-18.js:2:10
 const isOver18 = (user) => {
-  return user.age >= 18
+  return false
 }
 
killedBy: isOver18 works with eq
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
Projects/stryker/src/is-over-18.js:2:10
 const isOver18 = (user) => {
-  return user.age >= 18
+  return user.age < 18
 }
 
killedBy: isOver18 works with eq
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
